Revit 2027 API
PerformanceAdviserRuleId Constructor
Creates a new PerformanceAdviserRuleId instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PerformanceAdviserRuleId(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
PerformanceAdviserRuleId(
	Guid guid
)
new :
        guid : Guid -> PerformanceAdviserRuleId
Parameters
guid Guid
The identifier for the PerformanceAdviserRuleId.
See Also
Reference
PerformanceAdviserRuleId Class
Autodesk.Revit.DB Namespace